Public Attributes | List of all members
API_FloorPlanCutDefinition Struct Reference
Project Settings
Parameters of the Floor Plan Cut Plane Settings dialog. More...
#include <APIdefs_Environment.h>
 Public Attributes
double  | currCutLevel
The level of the cut plane that determines the appearance of elements on the floor plan of the current view.
double  | topCutLevel
Upper limit of the view range relative to the top story specified in topCutBaseStoryRelInd.
double  | bottomCutLevel
Lower limit of the view range relative to the bottom story specified in bottomCutBaseStoryRelInd.
short  | topCutBaseStoryRelInd
Elements of the floor plan will be displayed up to the given number of stories above the cut plane.
short  | bottomCutBaseStoryRelInd
Elements of the floor plan will be displayed down to the given number of stories below the cut plane.
Int32  | filler
double  | fixLevel2Absolute0
The absolute lowest display limit relative to the project zero where the elements of the floor plan are visible.
Detailed Description
Parameters of the Floor Plan Cut Plane Settings dialog.
Remarks
The Floor Plan Cut Plane Settings define the visibility limitations of floor plan elements on the current view. In their Floor Plan and Section settings the model elements can be set to be displayed on the floor plan according to the relative floor plan range or the absolute display limit (see API_ElemViewDepthLimitationsID). In order to access to these global parameters use the ACAPI_ProjectSetting_GetPreferences environment function with the API_FloorPlanCutDefinition structure and APIPrefs_FloorPlanCutPlaneDef preferences type ID.
Member Data Documentation
◆ bottomCutBaseStoryRelInd
 API_FloorPlanCutDefinition::bottomCutBaseStoryRelInd
Elements of the floor plan will be displayed down to the given number of stories below the cut plane.
◆ bottomCutLevel
 API_FloorPlanCutDefinition::bottomCutLevel
Lower limit of the view range relative to the bottom story specified in bottomCutBaseStoryRelInd.
◆ currCutLevel
 API_FloorPlanCutDefinition::currCutLevel
The level of the cut plane that determines the appearance of elements on the floor plan of the current view.
◆ filler
 Int32 API_FloorPlanCutDefinition::filler
◆ fixLevel2Absolute0
 API_FloorPlanCutDefinition::fixLevel2Absolute0
The absolute lowest display limit relative to the project zero where the elements of the floor plan are visible.
◆ topCutBaseStoryRelInd
 API_FloorPlanCutDefinition::topCutBaseStoryRelInd
Elements of the floor plan will be displayed up to the given number of stories above the cut plane.
◆ topCutLevel
 API_FloorPlanCutDefinition::topCutLevel
Upper limit of the view range relative to the top story specified in topCutBaseStoryRelInd.